"""
Умова задачі №2
Шаховий офіцер («слон») ходить по діагоналі.
Дано дві різні клітинки шахової дошки, визначте,
чи може офіцер потрапити з першої клітини на другу за один хід.
Програма отримує на вхід чотири числа від 1 до 8 кожне,
що задають номер стовпця і номер рядка спочатку для першої клітинки,
потім для другої клітинки. Програма повинна вивести Yes,
якщо з першої клітинки ходом офіцера можна потрапити в другу
або No в іншому випадку.
Автор: Мотовилець Марія
"""
#вводимо номери стовпців та рядків
first_column = int(input("Введіть номер стовпця першої клітнки: "))
first_line = int(input("Введіть номер рядка першої клітнки: "))
second_column = int(input("Введіть номер стовпця другої клітнки: "))
second_line = int(input("Введіть номер рядка другої клітнки: "))
                  
#виконуємо віднімання
a = first_column - second_column
b = first_line - second_line

#перевірка ти виведення результату
if abs(a) == abs(b):
    print("Yes")
else:
    print("No")
